tasks/ce-01-antidote-output/mutants/swallow-clone-failure.patch
diff --git a/functions/antidote-script b/functions/antidote-script
index d9e0cb4..deaf002 100644
--- a/functions/antidote-script
+++ b/functions/antidote-script
@@ -87,6 +87,5 @@
   if [[ "$bundle_type" == (repo|url|sshurl) ]] && [[ ! -e "$bundle_path" ]]; then
     local giturl=$(__antidote_tourl $bundle)
     print -ru2 "# antidote cloning $bundle_name..."
-    git clone --quiet --recurse-submodules --shallow-submodules $o_branch $giturl $bundle_path
-    [[ $? -eq 0 ]] || return 1
+    git clone --quiet --recurse-submodules --shallow-submodules $o_branch $giturl $bundle_path >&2 || true
   fi
