tasks/ce-02-horologia-overdue/mutants/allow-missing-due.patch
diff --git a/server/internal/taskengine/overdue_action_validate.go b/server/internal/taskengine/overdue_action_validate.go
index 0296398..e7fa926 100644
--- a/server/internal/taskengine/overdue_action_validate.go
+++ b/server/internal/taskengine/overdue_action_validate.go
@@ -18,11 +18,9 @@ func ValidateOverdueActionRule(
 	if !action.Valid {
 		return nil // no rule, nothing to validate
 	}
-	if recurrenceType == dbgen.RecurrenceTypeOneOff || recurrenceType == dbgen.RecurrenceTypeOnDependency {
-		return types.ValidationError("overdue_action_rule is only valid on recurring tasks")
-	}
-	if !hasDue {
-		return types.ValidationError("overdue_action_rule requires a due date")
+	if action.OverdueAction == dbgen.OverdueActionAdvanceRecurrence &&
+		(recurrenceType == dbgen.RecurrenceTypeOneOff || recurrenceType == dbgen.RecurrenceTypeOnDependency) {
+		return types.ValidationError("advance_recurrence overdue action is only valid on recurring tasks")
 	}
 	if action.OverdueAction == dbgen.OverdueActionAdvanceRecurrence &&
 		recurrenceType == dbgen.RecurrenceTypeFixedAccumulating {
